In [1]:
import pandas as pd

# Create a custom DataFrame
custom_data = [
    {"sale_id": 1, "sale_rep_id": 101, "sale_date": "2024-01-01", "car_model": "Camry", "sale_amount": 20000, "priority": "High", "sale_status": "Completed"},
    {"sale_id": 2, "sale_rep_id": 102, "sale_date": "2024-01-02", "car_model": "Corolla", "sale_amount": 18000, "priority": "Medium", "sale_status": "Completed"},
    {"sale_id": 3, "sale_rep_id": 103, "sale_date": "2024-01-03", "car_model": "RAV4", "sale_amount": 30000, "priority": "High", "sale_status": "Completed"},
    {"sale_id": 2, "sale_rep_id": 102, "sale_date": "2024-01-02", "car_model": "Corolla", "sale_amount": 18000, "priority": "Medium", "sale_status": "Completed"},  # Duplicate
    {"sale_id": 4, "sale_rep_id": 104, "sale_date": "2024-01-04", "car_model": "Highlander", "sale_amount": 35000, "priority": "Low", "sale_status": "Pending"},
]

custom_df = pd.DataFrame(custom_data)

In [2]:
custom_data

[{'sale_id': 1,
  'sale_rep_id': 101,
  'sale_date': '2024-01-01',
  'car_model': 'Camry',
  'sale_amount': 20000,
  'priority': 'High',
  'sale_status': 'Completed'},
 {'sale_id': 2,
  'sale_rep_id': 102,
  'sale_date': '2024-01-02',
  'car_model': 'Corolla',
  'sale_amount': 18000,
  'priority': 'Medium',
  'sale_status': 'Completed'},
 {'sale_id': 3,
  'sale_rep_id': 103,
  'sale_date': '2024-01-03',
  'car_model': 'RAV4',
  'sale_amount': 30000,
  'priority': 'High',
  'sale_status': 'Completed'},
 {'sale_id': 2,
  'sale_rep_id': 102,
  'sale_date': '2024-01-02',
  'car_model': 'Corolla',
  'sale_amount': 18000,
  'priority': 'Medium',
  'sale_status': 'Completed'},
 {'sale_id': 4,
  'sale_rep_id': 104,
  'sale_date': '2024-01-04',
  'car_model': 'Highlander',
  'sale_amount': 35000,
  'priority': 'Low',
  'sale_status': 'Pending'}]

In [3]:
deduplicated_df = custom_df.drop_duplicates(subset=["sale_id"])

In [4]:
custom_df

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,priority,sale_status
0,1,101,2024-01-01,Camry,20000,High,Completed
1,2,102,2024-01-02,Corolla,18000,Medium,Completed
2,3,103,2024-01-03,RAV4,30000,High,Completed
3,2,102,2024-01-02,Corolla,18000,Medium,Completed
4,4,104,2024-01-04,Highlander,35000,Low,Pending

In [5]:
deduplicated_df

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,priority,sale_status
0,1,101,2024-01-01,Camry,20000,High,Completed
1,2,102,2024-01-02,Corolla,18000,Medium,Completed
2,3,103,2024-01-03,RAV4,30000,High,Completed
4,4,104,2024-01-04,Highlander,35000,Low,Pending

In [6]:
custom_df.sort_values(by="priority")

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,priority,sale_status
0,1,101,2024-01-01,Camry,20000,High,Completed
2,3,103,2024-01-03,RAV4,30000,High,Completed
4,4,104,2024-01-04,Highlander,35000,Low,Pending
1,2,102,2024-01-02,Corolla,18000,Medium,Completed
3,2,102,2024-01-02,Corolla,18000,Medium,Completed

In [7]:
priority_order = pd.CategoricalDtype(categories=["High", "Medium", "Low"])

In [8]:
custom_df["priority"] = custom_df["priority"].astype(priority_order)

In [9]:
custom_df.dtypes

sale_id           int64
sale_rep_id       int64
sale_date        object
car_model        object
sale_amount       int64
priority       category
sale_status      object
dtype: object

In [10]:
custom_df.sort_values(by="priority")

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,priority,sale_status
0,1,101,2024-01-01,Camry,20000,High,Completed
2,3,103,2024-01-03,RAV4,30000,High,Completed
1,2,102,2024-01-02,Corolla,18000,Medium,Completed
3,2,102,2024-01-02,Corolla,18000,Medium,Completed
4,4,104,2024-01-04,Highlander,35000,Low,Pending